youngsummer1/stm32project/stm32project/hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include <stdarg.h>//可变参数
#include <stdlib.h>
#include <string.h>
#include "OLED.h" 



uint8_t Serial_RxFlag = 0;
char Serial_RxPacket[100];


void Serial_Init()
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 9600; //波特率
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; //选择是否需要RTS和CTS(流控)
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;//选择发送还是输出，或是二者都要
	USART_InitStructure.USART_Parity = USART_Parity_No; //是否加上校验位
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//停止位长度
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长,无校验位,所以为8位
	USART_Init(USART1,&USART_InitStructure);


	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);


	USART_Cmd(USART1,ENABLE);
}

void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1, Byte);
	while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
}

void Serial_SendArray(uint8_t *Array, uint16_t Length)
{
	uint16_t i;
	for (i = 0; i < Length; i ++)
	{
		Serial_SendByte(Array[i]);
	}
}

void Serial_SendString(char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i ++)
	{
		Serial_SendByte(String[i]);
	}
}

uint32_t Serial_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y --)
	{
		Result *= X;
	}
	return Result;
}

void Serial_SendNumber(uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i ++)
	{
		Serial_SendByte(Number / Serial_Pow(10, Length - i - 1) % 10 + '0');
	}
}

int fputc(int ch, FILE *f)
{
	Serial_SendByte(ch);
	return ch;
} //重定向printf  使其输出部分改变   此时重定向到串口1  串口2用不了


void Serial_Printf(char *format, ...)
{
	char String[100];
	va_list arg;  //定义1个参数列表变量
	va_start(arg, format);  //从format开始接收参数表,放在参数列表中
	vsprintf(String, format, arg);
	va_end(arg); //释放参数表
	Serial_SendString(String);
}//可变参数



uint8_t Serial_GetRxFlag(void)
{
	if (Serial_RxFlag == 1)
	{
		Serial_RxFlag = 0;
		return 1;
	}
	return 0;
} //标志位判断

//uint8_t flag = 1 ;

//uint8_t GetFlag(void)
//{
//		return flag;
//} //标志位判断

//double Serial_GetRxData(void)
//{
//	double Serial_RxData1;
//	if(Serial_RxData[0]=='N' || Serial_RxData[0]=='S'){
//		
//			for(uint8_t i = 0;i<strlen(Serial_RxData)-1;i++){
//						Serial_RxData[i] = Serial_RxData[i+1];
//			}
//		Serial_RxData1=atof(Serial_RxData);	
//			if(Serial_RxData[0]=='S'){
//				Serial_RxData1 = -Serial_RxData1;
//			}
//			return Serial_RxData1;
//	}
//	else if (Serial_RxData[0]=='E' || Serial_RxData[0]=='W'){
//		flag = 2 ;
//		for(uint8_t i = 0;i<strlen(Serial_RxData)-1;i++){
//						Serial_RxData[i] = Serial_RxData[i+1];
//			}
//		Serial_RxData1=atof(Serial_RxData);	
//			if(Serial_RxData[0]=='W'){
//				Serial_RxData1 = -Serial_RxData1;
//			}
//			return Serial_RxData1;
//		}
//}


void USART1_IRQHandler(void)
{
	static uint8_t RxState = 0;
	static uint8_t pRxPacket = 0;
	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
	{

		uint8_t RxData = USART_ReceiveData(USART1);
		
		if (RxState == 0)
		{
			if (RxData == '@' && Serial_RxFlag == 0)
			{
				
				RxState = 1;
				pRxPacket = 0;
			}
		}
		else if (RxState == 1)
		{
			if (RxData == '\r')
			{
				RxState = 2;
			}
			else
			{
				Serial_RxPacket[pRxPacket] = RxData;
				pRxPacket ++;
			}
		}
		else if (RxState == 2)
		{
			if (RxData == '\n')
			{
				RxState = 0;
				Serial_RxPacket[pRxPacket] = '\0';
				Serial_RxFlag = 1;
			}
		}
		
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
	}
}
